app/controllers/libraries_controller.rb

  def index
    @libraries = Library.all
---
SELECT "libraries".* FROM "libraries"

    def set_library
      @library = Library.find(params[:id])
---
SELECT  "libraries".* FROM "libraries" WHERE "libraries"."id" = ? LIMIT ?  [["id", 25], ["LIMIT", 1]]